app/controllers/admin/companies_controller.rb

SELECT "companies".* FROM "companies"
---
    def index
      @companies = Company.all.map { |c| CompanyDecorator.new(c) }