app/controllers/artists_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 4]]
---
  def show
    @current_artist = User.artist.find(params[:id])

SELECT  "profiles".* FROM "profiles" WHERE "profiles"."user_id" = $1 LIMIT 1  [["user_id", 1]]
---
  def set_pagination
    artists = User.artist.includes(:profile).map { |a| UserDecorator.new(a) }