app/controllers/companies_controller.rb

  def index
    @companies = Company.includes(:owner).active.page(params[:page]).per(9)
---
SELECT  "companies".* FROM "companies" WHERE ("companies"."owner_id" IS NOT NULL) LIMIT 9 OFFSET 0
SELECT COUNT(*) FROM "companies" WHERE ("companies"."owner_id" IS NOT NULL)