app/controllers/networks_controller.rb

  def set_user
    user = User.find(params[:artist_id] || params[:professional_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]