app/controllers/professionals_controller.rb

  def show
    @current_professional = User.professional.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]